### Pandas:

#### What is Pandas?

**Pandas** is a Python library used for data manipulation and analysis.
It is built on top of NumPy and gives you two main data structures:

**Series** → 1D labeled array (like an Excel column).

**DataFrame** → 2D table with rows & columns (like an Excel sheet or SQL table).

In [1]:
import pandas as pd

**Pandas** is 1D array that holds any kind of data type.

In [2]:
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

#### Create a Series from dictionary:-

In [3]:
data = {'a':1,'b':2,'c':3,'d':4}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
data = [10,20,30]
index = ['a','b','c']

series = pd.Series(data,index=index)    #data and index must same length.
print(series)

a    10
b    20
c    30
dtype: int64

In [5]:
# Dataframe: 2D table with rows and columns.
# create a dataframe from dictionary of list.

data = {
    'Name': ['Ganesh','Amol','Sujit'],
    'Age' : [30,23,37],
    'City': ['Niphad','Nashik','Yeola']    
}

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age    City
0  Ganesh   30  Niphad
1    Amol   23  Nashik
2   Sujit   37   Yeola
<class 'pandas.core.frame.DataFrame'>

#### Create a dataframe from list of dictionaries:-

In [6]:
data = [
    {'Name':'Ganesh','Age':33,'City':'Nashik'},
    {'Name':'Chandu','Age':30,'City':'Pune'},
    {'Name':'Sushma','Age':29,'City':'Bangalore'},
    {'Name':'Rasika','Age':28,'City':'Texax'}
]

df1 = pd.DataFrame(data)
print(df1)
print(type(df1))

     Name  Age       City
0  Ganesh   33     Nashik
1  Chandu   30       Pune
2  Sushma   29  Bangalore
3  Rasika   28      Texax
<class 'pandas.core.frame.DataFrame'>

#### Reading data from CSV file:--

In [7]:
df = pd.read_csv('sales_data.csv')
df.head(10)   #first 10 records

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
5,10006,2024-01-06,Sports,Wilson Evolution Basketball,5,29.99,149.95,Asia,Credit Card
6,10007,2024-01-07,Electronics,MacBook Pro 16-inch,1,2499.99,2499.99,North America,Credit Card
7,10008,2024-01-08,Home Appliances,Blueair Classic 480i,2,599.99,1199.98,Europe,PayPal
8,10009,2024-01-09,Clothing,Nike Air Force 1,6,89.99,539.94,Asia,Debit Card
9,10010,2024-01-10,Books,Dune by Frank Herbert,2,25.99,51.98,North America,Credit Card

In [8]:
df.tail()   #last 10 records

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

#### Accessing data from dataframe:--

In [9]:
df1

     Name  Age       City
0  Ganesh   33     Nashik
1  Chandu   30       Pune
2  Sushma   29  Bangalore
3  Rasika   28      Texax

In [10]:
df1['Name']

0    Ganesh
1    Chandu
2    Sushma
3    Rasika
Name: Name, dtype: object

In [13]:
df1[['Name','Age']]

     Name  Age
0  Ganesh   33
1  Chandu   30
2  Sushma   29
3  Rasika   28

#### Location and Index Location:-- loc() and iloc()

In [19]:
df1.loc[0]    #It returns the entire row at index 0 as a pandas Series

Name    Ganesh
Age         33
City    Nashik
Name: 0, dtype: object

In [20]:
df1.loc[1]    #gives the second row

Name    Chandu
Age         30
City      Pune
Name: 1, dtype: object

In [22]:
df1.loc[0][0]

C:\Users\Administrator\AppData\Local\Temp\ipykernel_12076\750844073.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df1.loc[0][0]

'Ganesh'

In [23]:
df1.loc[0][1]

C:\Users\Administrator\AppData\Local\Temp\ipykernel_12076\2176522278.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df1.loc[0][1]

np.int64(33)

In [26]:
df1.iloc[0]     #df1.iloc[0] means: give me the first row (position 0) regardless of index label.

Name    Ganesh
Age         33
City    Nashik
Name: 0, dtype: object

In [27]:
df1.iloc[1]

Name    Chandu
Age         30
City      Pune
Name: 1, dtype: object

In [ ]:
#### Accessing specified ele